Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.4.149/edc/ATSAML11E14A.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_6" edc:nzwidth="0x20" edc:impl="0x3FFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x00000000" edc:access="------------------nnnnnnnnnnnnnn" edc:_addr="0x804018" edc:default="0x00000000">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NONSECC_EVSYS" edc:nzwidth="0x1" edc:desc="EVSYS Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM0" edc:nzwidth="0x1" edc:desc="SERCOM0 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM1" edc:nzwidth="0x1" edc:desc="SERCOM1 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_SERCOM2" edc:nzwidth="0x1" edc:desc="SERCOM2 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC0" edc:nzwidth="0x1" edc:desc="TC0 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC1" edc:nzwidth="0x1" edc:desc="TC1 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TC2" edc:nzwidth="0x1" edc:desc="TC2 Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_ADC" edc:nzwidth="0x1" edc:desc="ADC Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_DAC" edc:nzwidth="0x1" edc:desc="DAC Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_PTC" edc:nzwidth="0x1" edc:desc="PTC Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TRNG" edc:nzwidth="0x1" edc:desc="TRNG Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_CCL" edc:nzwidth="0x1" edc:desc="CCL Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_OPAMP" edc:nzwidth="0x1" edc:desc="OPAMP Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="NONSECC_TRAM" edc:nzwidth="0x1" edc:desc="TRAM Non-Secure">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_7" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x8433651E" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80401C" edc:default="0x8433651E">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_USERCRC" edc:nzwidth="0x20" edc:desc="CRC for USER[1,2,3] DWORDS"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:regionid="userid" edc:beginaddr="0x804020" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:erasepagesize="0x100"/>
    <edc:ConfigFuseSector edc:regionid="BOCOR_FUSES" edc:beginaddr="0x80C000" edc:endaddr="0x80C100" atdf:pagesize="0x40" edc:erasepagesize="0x100">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_0" edc:nzwidth="0x20" edc:impl="0xFF3FFF00" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xA0C000FF" edc:access="nnnnnnnn--nnnnnnnnnnnnnn--------" edc:_addr="0x80C000" edc:default="0xA0C000FF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:DCRFieldDef edc:cname="IDAU_BS" edc:nzwidth="0x8" edc:desc="Boot Secure"/>
            <edc:DCRFieldDef edc:cname="IDAU_BNSC" edc:nzwidth="0x6" edc:desc="Boot Non-Secure Callable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="BOOTROM_BOOTOPT" edc:nzwidth="0x8" edc:desc="Boot Option"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
