Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML11_DFP/4.4.149/edc/ATSAML11E14A.PIC
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_59" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C0EC" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORHASH_3" edc:nzwidth="0x20" edc:desc="Boot Configuration Row Hash bits 127:96"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_60" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C0F0" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORHASH_4" edc:nzwidth="0x20" edc:desc="Boot Configuration Row Hash bits 159:128"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_61" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C0F4" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORHASH_5" edc:nzwidth="0x20" edc:desc="Boot Configuration Row Hash bits 191:160"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_62" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C0F8" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORHASH_6" edc:nzwidth="0x20" edc:desc="Boot Configuration Row Hash bits 223:192"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="BOCOR_WORD_63" edc:nzwidth="0x20" edc:impl="0xFFFFFFFF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x80C0FC" edc:default="0xFFFFFFFF">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="BOOTROM_BOCORHASH_7" edc:nzwidth="0x20" edc:desc="Boot Configuration Row Hash bits 255:224"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:regionid="HSRAM" edc:beginaddr="0x20000000" edc:endaddr="0x20002000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBA" edc:beginaddr="0x40000000" edc:endaddr="0x40008000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBB" edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="APBC" edc:beginaddr="0x42000000" edc:endaddr="0x42004000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="PPB" edc:beginaddr="0xE0000000" edc:endaddr="0xE002F000" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0x1000" edc:_addr="0xE0000000"/>
      <edc:SFRDef ltx:memberofperipheral="DWT" edc:cname="DWT_CTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnn---nnnnnnnnnnnnn" edc:por="00001011000000000000000000000000" edc:mclr="00001011000000000000000000000000" edc:impl="0xFFFF1FFF" edc:_addr="0xE0001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:nzwidth="0x1" edc:desc="CYCCNT enable"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:nzwidth="0x4" edc:desc="POSTCNT preset"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:nzwidth="0x4" edc:desc="POSTCNT initial"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:nzwidth="0x1" edc:desc="Cycle count tap"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:nzwidth="0x2" edc:desc="Synchronization tap"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:nzwidth="0x1" edc:desc="PC sample enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:nzwidth="0x1" edc:desc="Exception trace enable"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:nzwidth="0x1" edc:desc="CPI event enable"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:nzwidth="0x1" edc:desc="Exception event enable"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:nzwidth="0x1" edc:desc="Sleep event enable"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:nzwidth="0x1" edc:desc="LSU event enable"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:nzwidth="0x1" edc:desc="Fold event enable"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:nzwidth="0x1" edc:desc="Cycle event enable"/>
            <edc:SFRFieldDef edc:cname="CYCDISS" edc:nzwidth="0x1" edc:desc="Cycle counter disabled secure"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:nzwidth="0x1" edc:desc="No profile counters"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:nzwidth="0x1" edc:desc="No cycle count"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:nzwidth="0x1" edc:desc="No external triggers"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:nzwidth="0x1" edc:desc="No trace packets"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:nzwidth="0x4" edc:desc="Number of comparators"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
